Revit 2026 API

# ImportOptions3DM(ImportOptions3DM) Constructor

---

Constructs a new instance of ImportOptions3DM as a copy of the provided import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ImportOptions3DM(
	ImportOptions3DM option
)
```
```vb
Public Sub New (
	option As ImportOptions3DM
)
```
```cpp
public:
ImportOptions3DM(
	ImportOptions3DM^ option
)
```
```fsharp
new :
        option : ImportOptions3DM -> ImportOptions3DM
```

#### Parameters

option ImportOptions3DM
     The 3DM import options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ImportOptions3DM Class

ImportOptions3DM Overload

Autodesk.Revit.DB Namespace